final List<Map<String, String>> Seconds_data = [
  {"question": "اذكر 5 ملاعب في اسبانيا", },
  {"question": "اذكر 5 لاعبين مصريين شاركوا في كاس العالم", },
  {"question": "اذكر 5 فرق افريقية غير عربية", },
  {"question": "اذكر 5 لاعبين لعبوا ل برشلونة و مانشتسر سيتي", },
  {"question": "اذكر5  فرق الطقم الاساسي مخطط", },
  {"question": "اذكر 5 اسامي ملاعب في انجلترا", },
  {"question": "اذكر 5 اسماء دول كسبت كاس اسيا", },
  {"question": "اذكر 5 فرق كسبت دوري الابطال وليست من الدوريات الخمسة الكبري", },
  {"question": "اذكر 5 لاعبين انجليز لعبوا بره انجلترا", },
  {"question": "اذكر 5 لاعبين من كوريا الجنوبية", },
  {"question": "اذكر 5 دول خسرت من الارجنتين في كاس العالم 2022", },
  {"question": "اذكر 5 لاعبين حصلوا علي دوري الابطال مع فرقتين مختلفتين", },
  {"question": "اذكر 5 لاعبين لعبوا ل3 فرق او اكتر في نفس الدوري", },
  {"question": "اذكر 5 لاعبين انتقلوا من الدوري الانجليزي ل ريال مدريد", },
  {"question": "اذكر 5 لاعبين انتقلوا من الدوري الانجليزي ل برشلونة", },
  {"question": "اذكر 5 فرق دربهم مورينيو", },
  {"question": "اذكر 5 لاعبين لعبوا كورة و ابنهم لعب كورة", },


];