final List<Map<String, String>> Btola_data = [
  {
    "name": " أمم افريقيا 2006",
    "Clue 1": "دور المجموعات: ساحل العاج - المغرب : 1-0",
    "Clue 2": "ربع النهائي: نيجيريا - تونس: 1-1",
    "Clue 3": "نص النهائي: مصر - السنغال 2-1",
    "Clue 4": "النهائي: مصر - ساحل العاج 0-0",
  },
  {
    "name": "أمم افريقيا 2019",
    "Clue 1": "دور المجموعات: الجزائر - السنغال : 1-1",
    "Clue 2": "دور ال16: نيجيريا - الكاميرون: 3-2",
    "Clue 3": "ربع النهائي: تونس - مدغشقر: 3-0",
    "Clue 4": "نص نهائي: السنغال - تونس: 1-0",
    "Clue 5": "النهائي:الجزائر - السنغال : 1-0",
  },  {
    "name": "دوري ابطال اوروبا 2012",
    "Clue 1": "دور المجموعات: ميلان - برشلونة : 2-2",
    "Clue 2": "دور ال16: بايرن ميونخ- بازل: 7-1",
    "Clue 3": "ربع نهائي: ريال مدريد - أبويل: 8-2",
    "Clue 4": "نص نهائي: بايرن ميونخ - ريال مدريد: 3-3",
    "Clue 5": "النهائي: تشسلسي - بايرن ميونخ: 1-1"
  },  {
    "name": "كأس العالم 2022",
    "Clue 1": "دور المجموعات: الارجنيين - المكسيك : 2-0 ",
    "Clue 2": "دور ال16: كرواتيا - اليابان : 1-1",
    "Clue 3": "ربع النهائي: فرنسا- انجلترا :2-1",
    "Clue 4": "نص نهائي:الارجنتين - كرواتيا : 3-0 ",
    "Clue 5": "النهائي: الارجنتين - فرنسا : 3-3"
  },{
    "name": "كأس العالم 2018",
    "Clue 1": "دور المجموعات: فرنسا - الدنمارك : 2-1 ",
    "Clue 2": "دور ال16: اسيانيا - روسيا : 1-1",
    "Clue 3": "ربع النهائي:بلجيكا - البرازيل : 2-1 ",
    "Clue 4": "نص نهائي:كرواتيا - انجلترا: 2-1 ",
    "Clue 5": "النهائي: كرواتيا - فرنسا: 2-4 "
  },{
    "name": "كأس العالم 2014",
    "Clue 1": "دور المجموعات: البرازيل - المكسيك : 0-0 ",
    "Clue 2": "دور ال16:الاوروجواي - كولومبيا : 0-2 ",
    "Clue 3": "ربع النهائي: فرنسا - المانيا : 0-1 ",
    "Clue 4": "نص نهائي: هولندا - الارجنتين : 0-0 ",
    "Clue 5": "النهائي: الارجنتين - المانيا : 0-1 "
  },{
    "name": "كأس العالم 2010",
    "Clue 1": "دور المجموعات: المانيا - صربيا: 0-1 ",
    "Clue 2": "دور ال16: الارجنتين - المكسيك : 3-1 ",
    "Clue 3": "ربع النهائي: البرازيل - هولندا : 1-2 ",
    "Clue 4": "نص نهائي: اسبانيا -المانيا : 1-0 ",
    "Clue 5": "النهائي: اسبانيا- هولندا : 1-0 "
  },{
    "name": "كأس عالم 2006",
    "Clue 1": "دور المجموعات: انجولا - المكسيك :0-0 ",
    "Clue 2": "دور ال16: ايطاليا- استراليا : 1-0 ",
    "Clue 3": "ربع النهائي: البرازيل - فرنسا : 0-1 ",
    "Clue 4": "نص نهائي:المانيا -ايطاليا : 0-2 ",
    "Clue 5": "النهائي:ايطاليا - فرنسا: 1-1 "
  },{
    "name": "كأس العالم 2002",
    "Clue 1": "دور المجموعات: الصين - البرازيل : 0-4 ",
    "Clue 2": "دور ال16: السنغال - السويد : 2-1 ",
    "Clue 3": "ربع النهائي: المانيا - امريكا :1-0 ",
    "Clue 4": "نص نهائي: كوريا الجنوبية - المانيا: 0-1 ",
    "Clue 5": "النهائي: المانيا - البرازيل : 0-2"
  },{
    "name": "",
    "Clue 1": "دور المجموعات: ",
    "Clue 2": "دور ال16: ",
    "Clue 3": "ربع النهائي: ",
    "Clue 4": "نص نهائي: ",
    "Clue 5": "النهائي: "
  },
];
