final List<Map<String, String>> Btola_data = [
  {
    "name": " أمم افريقيا 2006",
    "Clue 1": "دور المجموعات: ساحل العاج - المغرب : 1-0",
    "Clue 2": "ربع النهائي: نيجيريا - تونس: 1-1",
    "Clue 3": "نص النهائي: مصر - السنغال 2-1",
    "Clue 4": "النهائي: مصر - ساحل العاج 0-0",
  },
  {
    "name": "أمم افريقيا 2019",
    "Clue 1": "دور المجموعات: الجزائر - السنغال : 1-1",
    "Clue 2": "دور ال16: نيجيريا - الكاميرون: 3-2",
    "Clue 3": "ربع النهائي: تونس - مدغشقر: 3-0",
    "Clue 4": "نص نهائي: السنغال - تونس: 1-0",
    "Clue 5": "النهائي:الجزائر - السنغال : 1-0",
  },  {
    "name": "دوري ابطال اوروبا 2012",
    "Clue 1": "دور المجموعات: ميلان - برشلونة : 2-2",
    "Clue 2": "دور ال16: بايرن ميونخ- بازل: 7-1",
    "Clue 3": "ربع نهائي: ريال مدريد - أبويل: 8-2",
    "Clue 4": "نص نهائي: بايرن ميونخ - ريال مدريد: 3-3",
    "Clue 5": "النهائي: تشسلسي - بايرن ميونخ: 1-1"
  },  {
    "name": "",
    "Clue 1": "دور المجموعات: ",
    "Clue 2": "دور ال16: ",
    "Clue 3": "ربع النهائي: ",
    "Clue 4": "نص نهائي: ",
    "Clue 5": "النهائي: "
  },{
    "name": "",
    "Clue 1": "دور المجموعات: ",
    "Clue 2": "دور ال16: ",
    "Clue 3": "ربع النهائي: ",
    "Clue 4": "نص نهائي: ",
    "Clue 5": "النهائي: "
  },{
    "name": "",
    "Clue 1": "دور المجموعات: ",
    "Clue 2": "دور ال16: ",
    "Clue 3": "ربع النهائي: ",
    "Clue 4": "نص نهائي: ",
    "Clue 5": "النهائي: "
  },{
    "name": "",
    "Clue 1": "دور المجموعات: ",
    "Clue 2": "دور ال16: ",
    "Clue 3": "ربع النهائي: ",
    "Clue 4": "نص نهائي: ",
    "Clue 5": "النهائي: "
  },{
    "name": "",
    "Clue 1": "دور المجموعات: ",
    "Clue 2": "دور ال16: ",
    "Clue 3": "ربع النهائي: ",
    "Clue 4": "نص نهائي: ",
    "Clue 5": "النهائي: "
  },{
    "name": "",
    "Clue 1": "دور المجموعات: ",
    "Clue 2": "دور ال16: ",
    "Clue 3": "ربع النهائي: ",
    "Clue 4": "نص نهائي: ",
    "Clue 5": "النهائي: "
  },{
    "name": "",
    "Clue 1": "دور المجموعات: ",
    "Clue 2": "دور ال16: ",
    "Clue 3": "ربع النهائي: ",
    "Clue 4": "نص نهائي: ",
    "Clue 5": "النهائي: "
  },
];
