final List<Map<String, String>> guessThePlayer_data = [
  {
    "name": "",
    "Clue 1": "",
    "Clue 2": "",
    "Clue 3": "",
    "Clue 4": "",
    "Clue 5": ""
  },  {
    "name": "ادريانو",
    "Clue 1": "انا لعبت لدوري واحد من الدوريات الخمسة الكبري",
    "Clue 2": "فزت بالدوري 4 مرات متتالي",
    "Clue 3": "فزت بكأس العالم تحت 17 سنة 1999",
    "Clue 4": "كسبت هداف كوبا امريكا 2004 و كأس القارات 2005",
    "Clue 5": "مستواي انحدر جدا بعد وفاة والدي"
  },  {
    "name": "اسامواه جيان",
    "Clue 1": "لعبت لعدة اندية منها رين الفرنسي واوكسير الانجليزي",
    "Clue 2": "لعبت لعدة اندية عربية",
    "Clue 3": "حصلت علي هداف الدوري مع نادي العين الاماراتي",
    "Clue 4": "انا الهداف التاريخي لمنتخب بلادي",
    "Clue 5": "ضيعت ضربة جزاء مهمة في ربع نهائي كأس العالم"
  },  {
    "name": "محمد عبدالمنصف",
    "Clue 1": " لعبت مع عرفة السيد وابراهيم حسن واحمد عيد وعمرو مرعي ومحمد جمدي زكي واحمد فتحي وعبدالله السعيد",
    "Clue 2": "حصلت علي 6 انديه مع الاندية و2 مع المنتخب",
    "Clue 3": "من اشهر لاعبين الكورة في مصر واسمي مقتررن باحداث تاريخية",
    "Clue 4": "لعبت 460 ماتش مأخدتش ولا طرد",
    "Clue 5": "اكتر لاعب لعب مباريات في الدوري المصري"
  },  {
    "name": "احمد سعيد اوكا",
    "Clue 1": " لعبت في 10 اندية في مصر وليس منهم الاهلي او الزمالك",
    "Clue 2": "احترفت خارج مصر في نادي ليرس البلجيكي",
    "Clue 3": "سجلت هدف واحد مع منتخب مصر في 32 مباراة",
    "Clue 4": "كسب الكاس مرتين مع حرس الحدود",
    "Clue 5": "كنت مع مصر في كأس القارات 2009"
  },  {
    "name": "معروف يوسف ",
    "Clue 1": " انا لعبت ل4 فرق في الدوري المصري",
    "Clue 2": "لعبت 100 مباراة مع نادي قمة في مصر",
    "Clue 3": "عمري ما مثلت منتخب بلادي",
    "Clue 4": "سجلت 14 هدف في الدوري المصري مع كل الاندية اللي لعبت معاها",
    "Clue 5": "سجلت هدف مع الزمالك في الاسماعيلي و اورلاندو بارتس"
  },
  {
    "name": "Arthur Melo",
    "Clue 1": "بدأت مسيرتي في نادي غريميو البرازيلي وكسبت معهم الكوبا ليبراتادوريس.",
    "Clue 2": "لعبت لثلاثة من الدوريات الخمسة الكبرى وهم الإنجليزي والإيطالي والإسباني.",
    "Clue 3": "لعبت مع بيلوتي وراكيتيتش وبوفون وكوتينيو ولويس سواريز وتياجو الكانتارا ودوجلاس كوستا ورابيو وميسي.",
    "Clue 4": "فزت بدوريين وكأسين وسوبرين، وخسرت نهائي بطولة قارية مع نادي من الأندية التي لعبت لها في أوروبا.",
    "Clue 5": "فزت بالكوبا أمريكا 2019 مع البرازيل."
  },
  {
    "name": "Giovanni Trapattoni",
    "Clue 1": "من اشهر المدربين في تاريخ بلده و درب 3 اكير فرق في بلده",
    "Clue 2": "اخد الدوري في 4 دول ودرب 3 منتخبات",
    "Clue 3": "كسب 6 بطولات اوربية",
    "Clue 4": "اخر منصب تدريبي ليه كان مدرب ايرلندا ",
    "Clue 5": "اكتر مدرب كسب الدوري الايطالي"
  },
  {
    "name": "Hernan Crespo",
    "Clue 1": "لعبت في سبعة فرق طوال مسيرتي، منهم خمسة في الدوري الإيطالي.",
    "Clue 2": "حصلت على جائزة رجل المباراة في نهائي كأس الاتحاد الأوروبي سنة 1999.",
    "Clue 3": "حققت هداف الدوري الإيطالي موسم 2000 وحصلت على الدوري الإيطالي مرتين والدوري الإنجليزي مرة.",
    "Clue 4": "حققت الكأس والسوبر الإيطالي وكأس الاتحاد الأوروبي مع فريق غير موجود بدوري الأبطال حالياً.",
    "Clue 5": "كنت أول لاعب أرجنتيني يسجل ثنائية في نهائي دوري أبطال أوروبا، وأنا مدرب العين الإماراتي الحالي وفزت معهم بدوري أبطال آسيا."
  },
  {
    "name": "Rafael van der Vaart",
    "Clue 1": "لعبت في ثلاثة من الدوريات الخمسة الكبرى وهم الإنجليزي والألماني والإسباني.",
    "Clue 2": "لعبت مع فينسنت كومباني، تشوبوموتينج، ويسلي شنايدر، روبنهو، لوكا مودريتش، فان نيستلروي، وكايل والكر.",
    "Clue 3": "بدأت مسيرتي الاحترافية في نادي أياكس وحصلت معهم على كل الألقاب المحلية.",
    "Clue 4": "حصلت على جائزة موهبة السنة في أياكس موسم 2001 ثم حصلت على جائزة لاعب السنة في موسم 2002.",
    "Clue 5": "فزت بالسوبر الإسباني 2008 وكأس الـFA مع توتنهام 2008، وحصلت على جائزة الجولدن بوي سنة 2003، وأنهيت مسيرتي في فريق دنماركي ثم عملت كمساعد مدرب في الفريق لمدة سنتين."
  },
  {
    "name": "Juan Cuadrado",
    "Clue 1": "لعبت في سبعة فرق مختلفة وسجلت معهم 45 هدفاً.",
    "Clue 2": "بدأت اللعب مع المنتخب الوطني من 2010 ولعبت 115 مباراة سجلت خلالها 11 هدفاً.",
    "Clue 3": "في بداياتي كنت أفضل اللعب كمهاجم، وحالياً أستطيع اللعب في مركزين هما الجناح الأيمن والظهير الأيمن.",
    "Clue 4": "انتقلت إلى فريق جديد هذا الموسم، ولكن جماهير النادي غاضبة من الصفقة بسبب الحادثة التي حدثت بيني وبين حارس مرماهم في مباراة سابقة، وعلي إثر المشكلة تلك حصلت على إيقاف 3 مباريات.",
    "Clue 5": "قيل عني في وجود كريستيانو رونالدو معي في الفريق أنني سانتا كلوزة، أقوم بتوزيع الهدايا عليه وعلى غيره، ولهذا سموني ملك الأسيست. كما كنت على غلاف لعبة FIFA 16 نسخة أمريكا اللاتينية بجانب ميسي."
  },
  {
    "name": "Makroof Youssef",
    "Clue 1": "لعبت في أربعة فرق في الدوري المصري.",
    "Clue 2": "لعبت 100 مباراة مع نادي قمة في مصر في مختلف البطولات.",
    "Clue 3": "على الرغم من أنني لعبت لأربعة فرق في الدوري المصري، إلا أنني سجلت فقط 14 هدفاً في الدوري.",
    "Clue 4": "بدأت مسيرتي في الدوري النيجيري لأني وُلدت في نيجيريا، لكني أملك جنسية أفريقية أخرى ولعبت مع منتخب هذه الجنسية مباراة ودية وحيدة.",
    "Clue 5": "سجلت هدفاً مهماً لنادي الزمالك في مباريات ضد الإسماعيلي وأورلاندو بيراتس."
  }, {
    "name": "Franck Ribéry",
    "Clue 1": "لعب في أربع دوريات أوروبية ولعب نسختين كأس عالم.",
    "Clue 2": "فاز بـ 25 لقبًا في مسيرته على مستوى الأندية، ووصل إلى نهائي دوري الأبطال ثلاث مرات واستطاع الفوز بلقب واحد فقط.",
    "Clue 3": "لعب مع كل من (كلوزه، هنري، جيمس رودريغيز، مامادو نيانج، مارتن كاسيريس، برنس بواتينج، جيروم بواتينج، فريدريكو كييزا، لوكا توني، دييجو بيروتي، كاليخون، لوسيو).",
    "Clue 4": "لعب أكثر من 600 مباراة طوال مسيرته وسجل أكثر من 100 هدف وقام بأكثر من 200 أسيست.",
    "Clue 5": "فاز وترشح للعديد من الألقاب الفردية العالمية، وكان وصيف كأس العالم 2006."
  },
  {
    "name": "Javier Mascherano",
    "Clue 1": "لعب في دوريين فقط على المستوى الأوروبي وشارك في أربع نسخ كأس عالم.",
    "Clue 2": "فاز بـ 19 لقبًا في مسيرته على مستوى الأندية، ووصل إلى نهائي دوري الأبطال ثلاث مرات وفاز بلقبين فقط وكان وصيفًا مرة.",
    "Clue 3": "لعب مع (نيمار، شيرينجهام، أربيلوا، ريكيلمي، بيكيه، أيوب الكعبي، سافيولا، فيرناندو توريس، فابريجاس، أليكس سونج، أليكسيس سانشيز، روبيرتو أيالا).",
    "Clue 4": "لعب أكثر من 500 مباراة طوال مسيرته ولعب لجميع الفئات العمرية لمنتخب بلاده.",
    "Clue 5": "كان وصيف كأس العالم ووصيف كوبا أمريكا أربع مرات، ولم يفز ببطولة مع المنتخب الأول. يعمل الآن كمدرب وفاز ببطولة كمدرب."
  },
  {
    "name": "Mikel Arteta",
    "Clue 1": "فاز بالدوري البرتغالي وكأس البرتغال واثنين كأس الدوري البرتغالي وكأس الملك الإسباني.",
    "Clue 2": "لعب مع منتخب بلاده في ثلاث نهائيات قارية، وكل نهائي كان مع فئة عمرية مختلفة، وكسب اثنين منهم.",
    "Clue 3": "بدأ مسيرته الاحترافية في 2010 وتم استدعاؤه للمنتخب الأول لأول مرة في 2014.",
    "Clue 4": "أخر بطولة كسبها كانت في موسم 2018/2019.",
    "Clue 5": "خسر نهائيين متتاليين في الدوري الأوروبي. كان هداف كأس الملك عندما فاز بها، وأخذ لاعب الشهر في الليجا مرة واحدة فقط."
  },
  {
    "name": "Javier Pastore",
    "Clue 1": "فاز بدوري واحد، سوبر واحد، يوروبا واحد، كأس عالم الأندية واحد، وسوبر أوروبي واحد.",
    "Clue 2": "لعب لكل الفئات العمرية لمنتخب بلاده.",
    "Clue 3": "وصل إلى ثلاث نهائيات قارية مع منتخب بلاده في ثلاث فئات عمرية مختلفة وكسب واحد فقط.",
    "Clue 4": "بدأت مسيرتي الاحترافية في 2012 وتم استدعائي للمنتخب الأول لأول مرة في 2016 وسجلت ثلاثة أهداف في 19 مباراة.",
    "Clue 5": "في منتصف مسيرتي لعبت كقلب دفاع في فريق لم يكن مركزي. أكبر إنجازاتي في دوري الأبطال هو كوني وصيف دوري أبطال أوروبا."
  },
  {
    "name": "Saúl Ñíguez",
    "Clue 1": "سجلت هدفًا في فريق في نهائي بطولة، وبعدها بسنتين انتقلت إلى هذا الفريق.",
    "Clue 2": "فزت بجائزة أفضل لاعب محترف في الدوري الحالي.",
    "Clue 3": "لعبت مع المنتخب في 2 كأس عالم و2 أمم، ولعبت 3 كأس عالم للأندية.",
    "Clue 4": "فزت بخمسة دوريات وست بطولات قارية مع جميع الفرق التي لعبت بها.",
    "Clue 5": "كنت كابتن فريقي القديم وسجلت مع فريقي الحالي 33 هدفًا في 8 مواسم. كنت هداف الدوري مع فريقي القديم في آخر موسم لعبت فيه معهم، وفي ثالث موسم مع فريقي الجديد كنت هداف الفريق في الدوري رغم أنني لست مهاجمًا."
  },
  {
    "name": "Ali Maaloul",
    "Clue 1": "لعب في دوريين من الدوريات الخمسة الكبرى، وأول بطولة فزت بها كانت خارج أوروبا.",
    "Clue 2": "لعبت لثلاثة أندية مختلفة من نفس الدوري الذي ألعب فيه حاليًا.",
    "Clue 3": "في مسيرتي مع الأندية لم أفز سوى ببطولتين، واحدة خارج أوروبا والأخرى مع جوزيه مورينيو.",
    "Clue 4": "كنت وصيفًا في الدوري الأوروبي مرة.",
    "Clue 5": "لعبت لكل الفئات العمرية للمنتخب وفزت معهم ببرونزية كأس القارات."
  },
  {
    "name": "Stephan El Shaarawy",
    "Clue 1": "لعبت في خمس دوريات خلال مسيرتي، منهم ثلاث في الدوريات الخمسة الكبرى.",
    "Clue 2": "فزت بدوريين فقط من الثلاثة في الدوريات الخمسة الكبرى التي لعبت فيها.",
    "Clue 3": "لعبت مع (رومارينهو، كامبل، فيليبي كايسيدو، ويليان، صامويل إيتو، بتشواي، ماريو ليمينا، أدان، باريخو، كريسبو، سيندروس).",
    "Clue 4": "الخمسة دوريات التي لعبت فيها هي: أربعة في أوروبا (منها ثلاث في الدوريات الكبرى) ودوري عربي. لعبت على الأقل في فريقين في كل دوري ما عدا الدوري العربي لعبت فيه لفريق واحد.",
    "Clue 5": "أنا من أشهر لاعبي الوسط الدفاعيين في تاريخ فرنسا، رغم أنني لم أفز بأي بطولة مع المنتخب."
  },{
    "name": "Saúl Ñíguez",
    "Clue 1": "فاز بدوري واحد، سوبر واحد، يوروبا واحد، كأس عالم أندية واحد، وسوبر أوروبي واحد.",
    "Clue 2": "لعبت لكل الفئات العمرية لمنتخب بلادي.",
    "Clue 3": "وصلت إلى ثلاث نهائيات قارية مع منتخب بلادي في ثلاث فئات عمرية مختلفة، وكسبت واحدًا فقط.",
    "Clue 4": "بدأت مسيرتي الاحترافية في 2012 وتم استدعائي للمنتخب الأول لأول مرة في 2016، وسجلت ثلاثة أهداف في 19 مباراة.",
    "Clue 5": "في منتصف مسيرتي فجأة انتقلت إلى فريق ولعبت معهم موسمًا كقلب دفاع رغم أن هذا ليس مركزي. أكبر إنجازاتي في دوري الأبطال هو كوني وصيف دوري أبطال أوروبا في إحدى السنوات. أنا من ناشئي ريال مدريد ولعبت في مسيرتي في دوريين أوروبيين فقط."
  },
  {
    "name": "Lassana Diarra",
    "Clue 1": "لعبت في خمس دوريات خلال مسيرتي، منهم ثلاث في الدوريات الخمسة الكبرى.",
    "Clue 2": "فزت بدوريين فقط من الثلاثة في الدوريات الخمسة الكبرى التي لعبت فيها.",
    "Clue 3": "لعبت مع (رومارينهو، كامبل، فيليبي كايسيدو، ويليان، صامويل إيتو، بتشواي، ماريو ليمينا، أدان، باريخو، كريسبو، سيندروس).",
    "Clue 4": "الخمسة دوريات التي لعبت فيها هي: أربعة في أوروبا (منها ثلاث في الدوريات الكبرى) ودوري عربي. لعبت على الأقل في فريقين في كل دوري ما عدا الدوري العربي لعبت فيه لفريق واحد.",
    "Clue 5": "أنا من أشهر لاعبي الوسط الدفاعيين في تاريخ فرنسا، رغم أنني لم أفز بأي بطولة مع المنتخب."
  },  {
    "name": "أيمن حفني",
    "Clue 1": "لعب كصانع ألعاب وكان معروفًا بمهاراته.",
    "Clue 2": "فاز بالدوري المصري الممتاز مرتين، وكأس مصر ثلاث مرات، وكأس الكونفيدرالية.",
    "Clue 3": "لعب مع أحمد توفيق، أحمد عيد عبد الملك، إبراهيم صلاح، وعمر جابر.",
    "Clue 4": "سجل هدفًا ضد الأهلي في 2014.",
    "Clue 5": "بدأ مسيرته في مكسا وتم التعرف عليه في الأهلي طرابلس.",
  },
  {
    "name": "رونالدينيو",
    "Clue 1": "لعب مع ماوريسيو بوكيتينو، فيكتور فالديس، ليليان تورام، تييري هنري، كافو، وجوليو سيزار.",
    "Clue 2": "اعتزل في 2018.",
    "Clue 3": "فاز بكأس العالم مرة، دوري أبطال أوروبا مرة، لقبين في الدوري الإسباني، ولقب واحد في الدوري الإيطالي.",
    "Clue 4": "تم إدراجه في قائمة FIFA 100 لأعظم اللاعبين الأحياء في 2004.",
    "Clue 5": "له هدف مميز ضد تشيلسي. فاز بجائزة الكرة الذهبية مرة واحدة.",
  },
  {
    "name": "ريكاردو كارفاليو",
    "Clue 1": "لعب مع كريستيانو رونالدو، ديكو، جون تيري، فابينيو، كواريسما، ديدييه دروغبا، مسعود أوزيل، توماس ليمار.",
    "Clue 2": "فاز بالدوري الإنجليزي وكأس الاتحاد ثلاث مرات مع تشيلسي.",
    "Clue 3": "فاز بالدوري الإسباني وكأس إسبانيا مع ريال مدريد مرة.",
    "Clue 4": "فاز بالدوري البرتغالي مرتين مع بورتو ودوري أبطال أوروبا مرة مع بورتو.",
    "Clue 5": "كان لاعبًا رئيسيًا في فوز البرتغال ببطولة اليورو 2016 وتم اختياره كأفضل لاعب برتغالي في 2003. لعب كمدافع مركزي (CB).",
  },
  {
    "name": "ديميتار بيرباتوف",
    "Clue 1": "لعب لنادي باير ليفركوزن، توتنهام، مانشستر يونايتد، فولهام، وموناكو.",
    "Clue 2": "اعتزل في 2019، وسجل 94 هدفًا و47 تمريرة حاسمة في الدوري الإنجليزي.",
    "Clue 3": "فاز بجائزة هداف الدوري الإنجليزي في موسم 2010/2011 بـ 20 هدفًا.",
    "Clue 4": "فاز بالدوري الإنجليزي مرتين مع مانشستر يونايتد (2008/09 و2010/11).",
    "Clue 5": "تم اختياره كأفضل لاعب بلغاري سبع مرات.",
  },
  {
    "name": "خالد الغندور",
    "Clue 1": "لعب مع أحمد شوبير، حازم إمام، أيمن منصور، حسام حسن، هاني رمزي، وعبد الواجد السيد.",
    "Clue 2": "بدأ وانتهى مسيرته في الزمالك، مع فترة ملحوظة في نادي كاظمة الكويتي.",
    "Clue 3": "كان من أكثر لاعبي الزمالك نجاحًا، وفاز بالدوري المصري، كأس أفريقيا، كأس السوبر الأفريقي، البطولة العربية للأندية، وكأس السوبر المصري السعودي.",
    "Clue 4": "معروف بلقب \"المدافع الأسطوري\".",
    "Clue 5": "يعد من أكثر قائدي الفريق فوزاً بالبطولات في تاريخ نادي الزمالك",
  },
  {
    "name": "إسلام الشاطر",
    "Clue 1": "لعب لنادي بتروجيت، الإسماعيلي، الزمالك، والأهلي.",
    "Clue 2": "كانت له مسيرة بارزة في السعودية مع اتحاد جدة.",
    "Clue 3": "اللاعب الوحيد في تاريخ كرة القدم المصرية الذي فاز بالدوري المصري مع ثلاثة فرق مختلفة.",
    "Clue 4": "انتقل إلى حرس الحدود بعد قرار مفاجئ من مانويل جوزيه وفاز معهم بكأس مصر مرتين.",
    "Clue 5": "انتقل إلى الإعلام بعد اعتزاله وقدم برامج رياضية في عدة قنوات.",
  },
  {
    "name": "غابرييل باتيستوتا",
    "Clue 1": "لعب كمهاجم وبدأ مسيرته كلاعب كرة سلة.",
    "Clue 2": "لعب لأندية روما، إنتر، فيورنتينا، والعربي القطري.",
    "Clue 3": "اللاعب الوحيد الذي سجل هاتريك في كؤوس عالم مختلفة.",
    "Clue 4": "ثاني أعلى هداف للأرجنتين.",
    "Clue 5": "لعب للأرجنتين في 1998.",
  },
];
